

# 1C Settings
HTTP_TIMEOUT = 10
ONEC_IP = '192.168.122.133'
ONEC_DB = 'zarmed'

# BOT Settings
LANG_EN_BUT = "🇬🇧 English"
LANG_UZ_BUT = "🇺🇿 Uzbek"
LANG_RU_BUT = "🇷🇺 Russian" 


LANG_RU_EN_UZ =  {
  
  "Hello": ["Здравствуйте 👋,",
            "Hello 👋,",
            "Здравствуйте 👋,"],
  
  "Hello_mess": [" \nВас приветствует бот клиники Zarmed!",
                 " \nZarmed clinic bot welcomes you!",
                 " \nВас приветствует бот клиники Zarmed!"],
  
  "Select_Lang_err": ["Пожалуйста, выберите язык!",
                      "Please, select your language!",
                      "Пожалуйста, выберите язык!"],
  
  "Option_location": ["📞 Контакты и локации",
                      "📞 Contacts and locations",
                      "📞 Контакты и локации"],
  
  "Option_cabinet": ["👤 Персональный кабинет",
                     "👤 Personalized User Area",
                     "👤 Персональный кабинет"],
  
  "Option_language": ["🇷🇺 Выбрать язык",
                      "🇬🇧 Select language",
                      "🇺🇿 Выбрать язык"],
  
  "Option_select_message": ["Выберите действие:",
                            "Select an option:",
                            "Выберите действие:"],
  
  
  "Location1_Mess": ["📗 <b>Адрес центральной клиники:</b>\nСамарканд, Самаркандская область, Ул. Исаева 16, 140100\n\n<b>Телефон:</b>\n+998557021063\n\n\n",
                     "📗 <b>Address of the head clinic:</b>\nSamarqand, Samarqand district, Isayev Str 16, 140100\n\n<b>Telephone:</b>\n+998557021063\n\n\n",
                     "📗 <b>Адрес центральной клиники:</b>\nСамарканд, Самаркандская область, Ул. Исаева 16, 140100\n\n<b>Телефон:</b>\n+998557021063\n\n\n"],
  
  "Location1": [[39.648779, 66.946713],
                [39.648779, 66.946713],
                [39.648779, 66.946713]],
  
  "Pers_area_hello": ["🪪 <b>Данный раздел позволяет получить результаты ваших анализов и приемов врачей.</b>\nДля входа сфотографируйте qr-код либо введите идентификатор пользователя (синее поле) и код (красное поле) в виде: \n<b>12345678 12345678</b>",
                      "🪪 <b>This section allows you to get the results of your tests and doctor's appointments.</b>\nTo enter take a picture of the qr-code or enter your user ID (blue field) and code (red field) as \n<b>12345678 12345678</b>.",
                      "🪪 <b>Данный раздел позволяет получить результаты ваших анализов и приемов врачей.</b>\nДля входа сфотографируйте qr-код либо введите идентификатор пользователя (синее поле) и код(красное поле) в виде: \n<b>12345678 12345678</b>"],
                      
  "Pers_area_cancel_button": ["Для выхода нажмите кнопку отмена.",
                        "Press cancel button to exit.",
                        "Для выхода нажмите кнопку отмена."],
  
  "Pers_area_wrong_qr": ["Этот QR код не является правильным кодом авторизации.",
                          "This QR is not a valid authorization code.",
                          "Этот QR код не является правильным кодом авторизации."],
  
  "Pers_area_nota_qr": ["QR не обнаружен.",
                        "QR code not found.",
                        "QR не обнаружен."],
  
  "Pers_area_auth_inprogress": ["Попытка авторизации... ⏳",
                                "Trying to authorize... ⏳",
                                "Попытка авторизации... ⏳"],
  
  "Pers_area_auth_wrong_input": ["Неправильный ввод. Попробуйте еще раз.",
                                  "Wrong input. Try again.",
                                  "Неправильный ввод. Попробуйте еще раз."],
  
  
  "Pers_area_auth_wrong_auth_data": ["Данные пользователя неверны или пользователь не найден. Попробуйте еще раз.",
                                     "Wrong authorization data or user not found. Try again.",
                                     "Данные пользователя неверны или пользователь не найден. Попробуйте еще раз."],
    
    
  
  "Pers_area_appointment_nodata": ["За данную дату документов не обнаружено.",
                                "No data can be found for this date.",
                                "За данную дату документов не обнаружено."],
  
  "Pers_area_appointment_yourapps": ["Ваши анализы и приемы врачей за дату ",
                                "Your results and appointments for the date ",
                                "Ваши анализы и приемы врачей за дату "],
  
  
 
  "Cancel": ["❌ Отмена",
             "❌ Cancel",
             "❌ Отмена"],
  
  
  "General_err_un": ["Данная функция в данный момент недоступна.",
                     "This feature is temporarly unavailable.",
                     "Данная функция в данный момент недоступна."]
}


 