 
LANG_RU_EN_UZ =  {
  
  "Hello": ["Здравствуйте,",
            "Hello,",
            "Здравствуйте,"],
  
  "Hello_mess": [" \nВас приветствует бот клиники Zarmed!",
                 " \nZarmed clinic bot welcomes you!",
                 " \nВас приветствует бот клиники Zarmed!"],
  
  "Select_Lang_err": ["Пожалуйста, выберите язык!",
                      "Please, select your language!",
                      "Пожалуйста, выберите язык!"],
  
  "Option_location": ["📞 Контакты и локации",
                      "📞 Contacts and locations",
                      "📞 Контакты и локации"],
  
  "Option_cabinet": ["👤 Персональный кабинет",
                     "👤 Personalized User Area",
                     "👤 Персональный кабинет"],
  
  "Option_language": ["🇷🇺 Выбрать язык",
                      "🇬🇧 Select language",
                      "🇺🇿 Выбрать язык"],
  
  "Option_select_message": ["Выберите действие:",
                            "Select an option:",
                            "Выберите действие:"],
  
  
  "Location1_Mess": ["📗 <b>Адрес центральной клиники:</b>\nСамарканд, Самаркандская область, Ул. Исаева 16, 140100\n\n<b>Телефон:</b>\n+998557021063\n\n<b>Локация:</b>\n",
                     "📗 <b>Address of the head clinic:</b>\nSamarqand, Samarqand district, Isayev Str 16, 140100\n\n<b>Telephone:</b>\n+998557021063\n\n<b>Location:</b>\n",
                     "📗 <b>Адрес центральной клиники:</b>\nСамарканд, Самаркандская область, Ул. Исаева 16, 140100\n\n<b>Телефон:</b>\n+998557021063\n\n<b>Локация:</b>\n"],
  
  "Location1": [[39.648779, 66.946713],
                [39.648779, 66.946713],
                [39.648779, 66.946713]],
  
  "Pers_area_hello": ["\n🪪 <b>Данный раздел позволяет получить результаты ваших анализов и приемов врачей.</b>\n\nВведите идентификатор пользователя и пароль в виде: \n\n<b>1243677 hjjhg4556</b>",
                      "\n🪪 <b>This section allows you to get the results of your tests and doctor's appointments.</b>\n\nEnter your user ID and password as \n\n<b>1243677 hjjhg4556</b>.",
                      "\n🪪 <b>Данный раздел позволяет получить результаты ваших анализов и приемов врачей.</b>\n\nВведите идентификатор пользователя и пароль в виде: \n\n<b>1243677 hjjhg4556</b>"],
                      
                      
  "Pers_area_scan_qr": ["Сфотографировать QR код",
                        "Take a picture of QR code",
                        "Сфотографировать QR код"],
  
  "Pers_area_wrong_qr": ["Этот QR код не является правильным кодом авторизации.",
                          "This QR is not a valid authorization code.",
                          "Этот QR код не является правильным кодом авторизации."],
  
  "Pers_area_nota_qr": ["QR не обнаружен.",
                        "QR code not found.",
                        "QR не обнаружен."],
  
  "Cancel": ["❌ Отмена",
             "❌ Cancel",
             "❌ Отмена"],
  
  
  "General_err_un": ["Данная функция в данный момент недоступна.",
                     "This feature is temporarly unavailable.",
                     "Данная функция в данный момент недоступна."]
}


 